%ï¿½ï¿½Ê¼ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½?
a=3.174;
d=1.469;
e1=0;
e2=3;
e3=0;
e4=-3;
e5=-3;
e6=-3;


 %ä»¥ä¸‹å‚æ•°ä¸­ï¼Œä¸‹æ ‡aè¡¨ç¤ºè¥¿æ ¼çŽ›é”®ï¼Œbè¡¨ç¤ºÏ€é”®ï¼Œcè¡¨ç¤ºÎ´ï¿???????
 Vdda=-0.5;
 Vddb=1.5;%ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ô¸Ä±ï¿½ï¿½Ôµï¿½ï¿½Ò»ï¿½Îµï¿½Æ½ï¿½ï¿½ï¿½Í¶ï¿½ï¿½Í³Ì¶ï¿½
 Vddc=1.5;%ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Kï¿½ã¸½ï¿½ï¿½ï¿½Ä¹È±ï¿½ï¿½ï¿½
 Vpda=1.2;%ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½e1ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ð¼ï¿½Ä·ï¿½ï¿½ï¿?
 Vpdb=0.6;

 Vppa=0;
 Vppb=0;

 %ç£ï¿½?ï¿½å’ŒSOCå‚æ•°
 c=0;
 m1=0.3;
 m2=0.3;





 %ä»ŽMç‚¹åˆ°K+ï¿????
    
%ä»ŽMç‚¹åˆ°K+ï¿????
kx=-1/sqrt(3)*0+1/sqrt(3)*0;
ky=0;

H=TBMatrix(a,d,e1,e2,e3,e4,e5,e6,Vdda,Vddb,Vddc,Vpda,Vpdb,Vppa,Vppb,c,m1,m2,kx,ky);

[eigvector,eigvalue]=eig(H)










